{
  "category_name": "Metaheuristic Algorithms & Computational Methods",
  "description": "Studies on metaheuristic algorithms, optimization techniques, and computational methodologies",
  "paper_count": 12,
  "papers": [
    {
      "filename": "undefined series for scimag 5 - Anna’s Archive.pdf",
      "title": "No-Wait Job Shop Scheduling Using a Population-Based Iterated Greedy Algorithm",
      "abstract": "When no-wait constraint holds in job shops, a job has to be processed with no waiting time from the first to the last operation, and the start time of a job is greatly restricted. Using key elements of the iterated greedy algorithm, this paper proposes a population-based iterated greedy (PBIG) algorithm for finding high-quality schedules in no-wait job shops. Firstly, the Nawaz-Enscore-Ham (NEH) heuristic used for flow shop is extended in no-wait job shops, and an initialization scheme based on the NEH heuristic is developed to generate start solutions with a certain quality and diversity. Secondly, the iterated greedy procedure is introduced based on the destruction and construction perturbator and the insert-based local search. Furthermore, a population-based co-evolutionary scheme is presented by imposing the iterated greedy procedure in parallel and hybridizing both the left timetabling and inverse left timetabling methods. Computational results based on well-known benchmark instances show that the proposed algorithm outperforms two existing metaheuristics by a significant margin.",
      "method": "Population-based iterated greedy (PBIG) algorithm utilizing a co-evolutionary scheme, incorporating a destruction and construction perturbator and an insertion-based local search, as well as the Nawaz-Enscore-Ham (NEH) heuristic for initialization.",
      "objectives": "To develop an effective algorithm for solving the no-wait job shop scheduling problem (NWJSP) and to demonstrate its effectiveness through computational experiments comparing with existing metaheuristics.",
      "summary": "The no-wait job shop scheduling problem (NWJSP) imposes significant operational constraints where jobs must be processed without any waiting time between operations. This paper tackles the complexity of NWJSP, which is classified as NP-hard, by proposing a novel population-based iterated greedy (PBIG) algorithm, enhancing the iterated greedy framework by integrating co-evolutionary strategies. The main contributions of this research include an extension of the widely recognized Nawaz-Enscore-Ham (NEH) heuristic adapted for NWJSP to ensure high-quality initial solutions and a sophisticated initialization scheme aimed at generating diverse starting points for the algorithm.\n\nThe PBIG operates through a structured procedural framework that consists of a three-phase iterated greedy process: first using a destruction and construction approach to create candidate solutions, followed by a localized insertion-based improvement phase, to refine the solutions iteratively. This algorithm exploits population dynamics by processing multiple solutions concurrently, applying co-evolutionary strategies that enhance the algorithmic diversity and convergence speed. Moreover, it combines various timetabling methods, notably the left and inverse left timetabling techniques, which are shown to significantly improve performance metrics.\n\nThe computational analysis involved executing the PBIG against established benchmarks and comparing its efficacy against two competing metaheuristics. The results indicate that PBIG not only provides superior schedule quality but also achieves this with greater computational efficiency, substantiating its practicality for industrial applications that face the no-wait constraints typical in sectors like steel-making, pharmaceuticals, and food production. The findings importantly underscore the capabilities of the PBIG framework in engaging with complex scheduling challenges, which promise further insights and advancements in scheduling methodologies in future research.",
      "categories": [
        "no-wait",
        "job shop",
        "local search",
        "iterated greedy",
        "metaheuristics"
      ],
      "processed_at": "2025-08-20 01:39:59"
    },
    {
      "filename": "a_1018940026670 -- 05c53464d92fe234f0504594cdfce2dc -- Anna’s Archive.pdf",
      "title": "An improved Ant System algorithm for the Vehicle Routing Problem",
      "abstract": "The Ant System is a distributed metaheuristic that combines an adaptive memory with a local heuristic function to repeatedly construct solutions of hard combinatorial optimization problems. In this paper, we present an improved ant system algorithm for the Vehicle Routing Problem with one central depot and identical vehicles. Computational results on fourteen benchmark problems from the literature are reported and a comparison with five other metaheuristic approaches for solving Vehicle Routing Problems is given.",
      "method": "An improved ant system algorithm utilizing a local heuristic approach and an adaptive memory to solve the Vehicle Routing Problem.",
      "objectives": "To present an improved Ant System for the Vehicle Routing Problem (VRP) and evaluate its performance against established metaheuristic methods.",
      "summary": "This paper introduces an enhanced Ant System algorithm aimed at addressing the Vehicle Routing Problem (VRP) characterized by a single central depot and homogeneous vehicles. The methodology emphasizes the interaction of artificial ants which emulate behaviors observed in natural ant colonies during their search for food. The improved algorithm takes advantage of local heuristic functions and adaptive memory (akin to pheromone trails), facilitating the construction of competitive solutions. The authors applied their algorithm to fourteen benchmark problems, focusing on both randomly generated and clustered customer distributions. The comparative evaluation included five other established metaheuristics, such as tabu search and simulated annealing.\n\nKey contributions include meticulous description of the construction of vehicle routes, which involves probabilistic customer selection based on previous iterations and heuristic desirability. The model incorporates a trail update rule where updates are contingent on the quality of solutions produced by the best-ranked ants, thus refining the pheromone trails that guide future solutions. The computational results demonstrate the algorithm's competitiveness, although it could not improve upon the best-known solutions for the tested problems. Comparative results indicated that while tabu search methods yielded better solutions in general, the improved Ant System provided a valid alternative with notable improvements in solution quality and execution time.\n\nFuture research directions proposed include the exploration of different parameter settings, incorporation of VRP-specific local search methods, and potential parallel implementation of the algorithm. The findings substantiate the efficacy of the improved Ant System, suggesting promising avenues for further advancements in solving the VRP and related combinatorial optimization problems.",
      "categories": [
        "ant system",
        "adaptive memory",
        "vehicle routing",
        "metaheuristics"
      ],
      "processed_at": "2025-08-20 01:39:59"
    },
    {
      "filename": "Evolutionary tabu search for flexible due-date satisfaction in fuzzy job shop scheduling - Anna’s Archive.pdf",
      "title": "Evolutionary tabu search for flexible due-date satisfaction in fuzzy job shop scheduling",
      "abstract": "We consider the job shop scheduling problem with fuzzy sets modelling uncertain durations and flexible due dates. With the goal of maximising due-date satisfaction under uncertainty, we first give a new measure of overall due-date satisfaction in this setting. Then, we define a neighbourhood structure for local search, analyse its theoretical properties and provide a neighbour-estimation procedure. Additionally, a tabu search procedure using the neighbourhood is combined with a genetic algorithm, so the resulting memetic algorithm, guided by the defined due-date satisfaction measure, is run on a set of benchmarks. The obtained results illustrate the potential of our proposal.",
      "method": "We propose a hybrid evolutionary tabu search method to optimise due-date satisfaction.",
      "objectives": "To maximise due-date satisfaction under uncertainty in job shop scheduling problems using fuzzy sets.",
      "summary": "This paper addresses the job shop scheduling problem, specifically under conditions of uncertainty associated with task durations and flexible due dates. Traditional scheduling techniques often presume static conditions; however, in real-world applications, these variables can fluctuate, necessitating more adaptable approaches. The authors introduce a novel measure for determining the overall due-date satisfaction when using fuzzy sets, which effectively encapsulate the uncertain nature of scheduling environments. The hybrid methodology developed incorporates a tabu search integrated with a genetic algorithm, forming a memetic algorithm that leverages both global and local search strategies. Theoretical analysis of the local search component adds a solid foundation to the proposed method, ensuring robustness.\n\nExperimental results demonstrate the method's efficacy on benchmark problem sets, revealing significant improvements in due-date satisfaction compared to conventional approaches. Through careful selection of algorithm parameters and rigorous performance metrics, the study illustrates the effectiveness of the developed framework. This research not only contributes a new algorithm to the field but also enhances the existing decision-making processes surrounding job shop scheduling. By framing due-date satisfaction in a fuzzy context, the findings extend the applicability of fuzzy logic in operations research, potentially guiding future research directions toward more intricate, real-world applications where uncertainty cannot be ignored. The study underscores the importance of flexible scheduling in competitive environments where meeting delivery commitments can substantially impact customer satisfaction and operational efficiency. Thus, this work is crucial for industries reliant on dynamic scheduling environments, providing a pathway to optimize their operations while managing uncertainty.",
      "categories": [
        "Scheduling",
        "Fuzzy Sets",
        "Metaheuristics",
        "Due dates",
        "Tabu search"
      ],
      "processed_at": "2025-08-20 01:42:41"
    },
    {
      "filename": "j_asoc_2012_07_034 -- a038ffa32b8d52bb5c58c7886115282d -- Anna’s Archive.pdf",
      "title": "A hybrid Differential Evolution—Tabu Search algorithm for the solution of Job-Shop Scheduling Problems",
      "abstract": "The Job-Shop Scheduling Problem (JSSP) has drawn considerable interest during the last decades, mainly because of its combinatorial characteristics, which make it very difﬁcult to solve. The good performances attained by local search procedures, and especially Nowicki and Smutnicki’s i-TSAB algorithm, encouraged researchers to combine such local search engines with global methods. Differential Evolution (DE) is an Evolutionary Algorithm that has been found to be particularly efﬁcient for continuous optimization, but which does not usually perform well when applied to permutation problems. We introduce in this paper the idea of hybridizing DE with Tabu Search (TS) in order to solve the JSSP. A competitive neighborhood is included within the TS with the aim of determining if DE is able to replace the re-start features that constitute the main strengths of i-TSAB (i.e., a long-term memory and a path-relinking procedure). The computational experiments reported for more than 100 JSSP instances show that the proposed hybrid DE–TS algorithm is competitive with respect to other state-of-the-art techniques, although, there is still room for improvement if the adequacy between the solution representation modes within DE and TS is properly stressed.",
      "method": "A hybrid Differential Evolution (DE) and Tabu Search (TS) algorithm is proposed where DE determines promising regions in the search space while TS locates local optima within those regions. TS is integrated into the DE generational loop to improve the search efficiency. The algorithm utilizes a Random Keys encoding scheme for representation and applies a specialized neighborhood structure based on critical paths.",
      "objectives": "To develop a hybrid algorithm combining Differential Evolution and Tabu Search for solving Job-Shop Scheduling Problems effectively.",
      "summary": "The paper presents a novel hybrid algorithm that integrates Differential Evolution (DE) and Tabu Search (TS) to address the Job-Shop Scheduling Problem (JSSP), which is known for its computational complexity and has significant industrial applications. The primary motivation for this research stems from the unique combinatorial nature of JSSP, which often renders traditional optimization methods ineffective, particularly for larger instances. The authors devised a hybrid DE-TS algorithm that combines the global exploration strength of Differential Evolution with the local search capability of Tabu Search, creating a solution framework that not only seeks to optimize job scheduling sequences but also mitigates the common issues related to premature convergence associated with standard evolutionary algorithms.\n\nIn breaking down the method, the authors first elaborate on Differential Evolution's adaptation to permutation-based problems, utilizing a Random Keys encoding scheme to represent job sequences. The proposed algorithm operates by allowing DE to explore the search space and identify promising regions before invoking TS to perform local searches for the best schedules within those regions. A competitive neighborhood structure is implemented in TS to enhance the efficiency of local searches, particularly focusing on critical operation swaps, which have a direct impact on the overall makespan of schedules.\n\nThrough extensive computational experiments involving over 100 benchmark instances sourced from established problem libraries, the hybrid DE-TS algorithm demonstrated competitive performance relative to state-of-the-art scheduling algorithms including variants of Tabu Search. While the results showcased the algorithm's ability to achieve optimal solutions in many mid-sized instances, it also highlighted areas for potential improvement, specifically concerning the representation compatibility between DE and TS, and the need for more sophisticated initialization techniques to further augment performance.\n\nThe significance of the findings extends beyond mere algorithmic accomplishments; they contribute to the underlying discourse surrounding algorithm hybridization in solving NP-hard problems like JSSP. Moreover, this research paves the way for future exploration into more advanced hybrid methodologies, suggesting potential avenues like the integration of self-adaptive mechanisms in DE and improved constraint handling techniques that can enhance the robustness and adaptability of the proposed solutions for JSSP and similar combinatorial challenges to come.",
      "categories": [
        "Job-Shop Scheduling",
        "Differential Evolution",
        "Tabu Search"
      ],
      "processed_at": "2025-08-20 01:42:41"
    },
    {
      "filename": "Research on flexible job-shop scheduling problem in green sustainable manufacturing based on learning effect - Anna’s Archive.pdf",
      "title": "Research on flexible job-shop scheduling problem in green sustainable manufacturing based on learning effect",
      "abstract": "As one of the manufacturing industries with high energy consumption and high pollution, sand casting is facing major challenges in green manufacturing. In order to balance production and green sustainable development, this paper puts forward man-machine dual resource constraint mechanism. In addition, a multi-objective flexible job shop scheduling problem model constrained by job transportation time and learning effect is constructed, and the goal is to minimize processing time energy consumption and noise. Subsequently, a hybrid discrete multi-objective imperial competition algorithm (HDMICA) is developed to solve the model. The global search mechanism based on the HDMICA improves two aspects: a new initialization method to improve the quality of the initial population, and the empire selection method based on Pareto non-dominated solution to balance the empire forces. Then, the improved simulated annealing algorithm is embedded in imperial competition algorithm (ICA), which overcomes the premature convergence problem of ICA. Therefore, four neighborhood structures are designed to help the algorithm jump out of the local optimal solution. Finally, an example is used to verify the feasibility of the proposed algorithm. By comparing with the original ICA and other four algorithms, the effectiveness of the proposed algorithm in the quality of the first frontier solution is verified.",
      "method": "A hybrid discrete multi-objective imperial competition algorithm (HDMICA) is developed to solve the model, with improvements including a new initialization method, an empire selection method based on Pareto non-dominated solutions, and an improved simulated annealing algorithm embedded within ICA to address convergence issues.",
      "objectives": "To construct a multi-objective flexible job shop scheduling problem model constrained by job transportation time and the learning effect while minimizing processing time, energy consumption, and noise in sand casting manufacturing.",
      "summary": "This research tackles the critical issue of green manufacturing, particularly in the sand casting industry known for high energy consumption and pollution. The authors establish a novel dual resource constraint mechanism integrating both man and machine, which is essential in optimizing the flexible job-shop scheduling problem (FJSP) specific to this sector. A comprehensive multi-objective model is derived, emphasizing the minimization of processing time, energy consumption, and industrial noise while incorporating job transportation time and learning effects. A pivotal contribution of this work is the development of the hybrid discrete multi-objective imperial competition algorithm (HDMICA). This algorithm improves upon existing imperial competition algorithms, specifically in its population initialization and its use of Pareto-dominance for selection, thus enhancing global search capabilities. The integration of an enhanced simulated annealing approach mitigates premature convergence, allowing for a more robust exploration of the solution space through four distinct neighborhood structures. Performance validation is conducted through comparative analyses showcasing HDMICA's superior ability to yield higher quality solutions compared to both the original imperial competition algorithm and four other heuristic methods. The findings propose substantial practical implications for the casting industry, facilitating a shift towards more efficient and environmentally conscious manufacturing practices. This research not only fills an existing gap in the literature on FJSP under resource constraints but also sets a foundation for potential advancements in smart manufacturing applications, indicating a promising avenue for future research to explore additional complexities and real-world applications.",
      "categories": [
        "Green sustainable development",
        "Man-machine dual resource constraint mechanism",
        "FJSP",
        "Learning effect",
        "HDMICA",
        "Improved simulated annealing"
      ],
      "processed_at": "2025-08-20 01:47:48"
    },
    {
      "filename": "isda_2009_49 -- 2d4186368e5519a945d2f9e85e89bd4e -- Anna’s Archive.pdf",
      "title": "Solving permutation problems with Differential Evolution: An Application to the Jobshop Scheduling Problem",
      "abstract": "This study addresses the solution of Jobshop Scheduling Problems using Differential Evolution (DE). The issue of representing permutations through real numbers constitutes the key issue for developing an efficient implementation. Several techniques are empirically validated on problem instances traditionally adopted in the specialized literature. We also present a simple hybridization of DE with tabu search, which produces significant performance gains.",
      "method": "Differential Evolution (DE) method was adapted for solving the Jobshop Scheduling Problem (JSP) through various permutation representation techniques and a schedule builder. A hybridization with tabu search is also introduced.",
      "objectives": "To provide insights on using real numbers encodings for permutation problems with Differential Evolution and to evaluate its performance on Jobshop Scheduling Problem instances.",
      "summary": "The paper explores the application of Differential Evolution (DE) to solving Jobshop Scheduling Problems (JSP), a classic challenge in operational research that involves allocating machines to jobs in such a way that minimizes the completion time, or makespan. The primary difficulty lies in the effective representation of permutations of jobs using real numbers, which is addressed by developing new encoding methods within DE. The authors empirically validate various strategies on well-established problem instances. They identify three key permutation representation modes: random keys, dispatching rules, and binary priorities, each with their own strengths and weaknesses, and test these variants under different scheduling frameworks.\n\nIn their experiments, the DE algorithm is tuned with parameters such as mutation factor and crossover rate, set within specific bounds based on preliminary analyses. Results demonstrate that the random keys method yields the most promising outcomes in terms of solution quality and computational efficiency across various instances of the JSP. The study also includes a hybrid approach combining DE with tabu search (TS) which enhances the solution quality further, especially in more complex scenarios.\n\nComputational experiments reveal that while DE alone cannot compete with state-of-the-art algorithms like i-TSAB, its performance improves greatly when hybridized with local search techniques. The DE-TS hybrid showed competitive results, although the performance of DE alone improves more gradually, suggesting that the traditional modes of optimization may still dominate in effectively tackling the JSP. The key contributions of this work include advancements in representation schemes for DE applied to permutation problems and a foundation for further hybrid methodologies, potentially driving future research directions in this domain. Overall, the findings highlight DE's effectiveness when suitably adapted for structured scheduling environments, indicating room for improvement in algorithm development and integration of different optimization strategies.",
      "categories": [
        "Differential Evolution",
        "Jobshop Scheduling Problem",
        "permutation problems",
        "hybridization",
        "metaheuristics"
      ],
      "processed_at": "2025-08-20 01:58:54"
    },
    {
      "filename": "Improved Genetic Algorithm Approach Based on New Virtual Crossover Operators for Dynamic Job Shop Scheduling - Anna’s Archive.pdf",
      "title": "Improved Genetic Algorithm Approach Based on New Virtual Crossover Operators for Dynamic Job Shop Scheduling",
      "abstract": "The realtime manufacturing system is subject to different kinds of disruptions such as new job arrivals, machine breakdowns, and jobs cancellation. These different disruptions affect the original schedule that should be updated to maintain the system’s performance. An effective re-scheduling is required in this situation to make better utilization of the system resources. This paper studies the dynamic job shop scheduling problem, a known NP Hard optimization problem where new jobs arrive unconditionally at the system. To deal with system changes and perform hard tasks scheduling, we propose an evolutionary genetic algorithm based on virtual crossover operators. Experimental results show efficiency when compared with state-of-the-art heuristics and metaheuristics dedicated to evaluating large scale instances. Simulation results demonstrate the efficiency of the proposed virtual crossover operators integrated into the genetic algorithm approach.",
      "method": "An evolutionary genetic algorithm approach is proposed, utilizing new virtual crossover operators to effectively handle dynamic changes in job arrivals and machine breakdowns in scheduling.",
      "objectives": "To address the dynamic job shop scheduling problem by developing an effective genetic algorithm that utilizes novel crossover operators to improve scheduling efficiency in the face of dynamic disruptions.",
      "summary": "This study tackles the dynamic job shop scheduling problem (JSSP), a known NP-Hard optimization task characterized by the unpredictable arrival of new jobs, machine breakdowns, and task cancellations in realtime manufacturing environments. These disruptions necessitate effective re-scheduling strategies to maintain optimal utilization of system resources and to minimize makespan, which is defined as the completion time of the last job. This paper introduces an improved genetic algorithm (GA) enhanced by new virtual crossover operators designed specifically for dynamic conditions. The main contributions include a comprehensive literature review on existing techniques for dynamic JSSP and the development of a GA that integrates these crossover mechanisms to respond swiftly to alterations in schedule requirements. The GA operates by creating populations of job sequences, applying selection through a roulette wheel method, and utilizing the virtual crossover operators to produce offspring that inherit favorable traits from their parents without concerning themselves with the physical operation sequences. The study includes detailed testing of this GA against state-of-the-art heuristics and metaheuristics, analyzing performance metrics including makespan and computational efficiency. Simulation results indicate that the proposed method significantly improves performance, achieving better makespan values across various instances of dynamic JSSP compared to existing approaches. Its significance lies in providing a robust framework for scheduling in unpredictable manufacturing environments, thus presenting valuable insights for real-world applications where adaptability is essential. Future implications include further exploration of enhancing crossover strategies and integrating additional scheduling constraints to refine the algorithm's applicability in even more complex dynamic scenarios.",
      "categories": [
        "Dynamic job shop scheduling problem",
        "genetic algorithm",
        "crossover operators",
        "makespan",
        "dispatching rules",
        "metaheuristics"
      ],
      "processed_at": "2025-08-20 02:04:03"
    },
    {
      "filename": "s10845-011-0520-x -- 352a5c08b41f1bbb68ad68f5744fb432 -- Anna’s Archive.pdf",
      "title": "A hybrid genetic tabu search algorithm for solving job shop scheduling problems: a case study",
      "abstract": "In recent decades many attempts have been made at the solution of Job Shop Scheduling Problem using a varied range of tools and techniques such as Branch and Bound at one end of the spectrum and Heuristics at the other end. However, the literature reviews suggest that none of these techniques are sufficient on their own to solve this stubborn NP-hard problem. Hence, it is postulated that a suitable solution method will have to exploit the key features of several strategies. We present here one such solution method incorporating Genetic Algorithm and Tabu Search. The rationale behind using such a hybrid method as in the case of other systems which use GA and TS is to combine the diversified global search and intensified local search capabilities of GA and TS respectively. The hybrid model proposed here surpasses most similar systems in solving many more traditional benchmark problems and real-life problems. This, the system achieves by the combined impact of several small but important features such as powerful chromosome representation, effective genetic operators, restricted neighbourhood strategies and efficient search strategies along with innovative initial solutions. These features combined with the hybrid strategy employed enabled the system to solve several benchmark problems optimally, which has been discussed elsewhere in Meeran and Morshed (8th Asia Pacific industrial engineering and management science conference, Kaohsiung, Taiwan, 2007). In this paper we bring out the system’s practical usage aspect and demonstrate that the system is equally capable of solving real life Job Shop problems.",
      "method": "Hybrid method combining Genetic Algorithm (GA) and Tabu Search (TS). GA employs global search and parallel exploration of solution space, while TS enhances local search to avoid poor local minima. The system utilizes innovative initial solutions, chromosome representation, and efficient genetic operators.",
      "objectives": "To minimize the total completion time (make-span) for job shop scheduling problems while satisfying operational constraints.",
      "summary": "The paper addresses the Job Shop Scheduling Problem (JSSP), an NP-hard combinatorial problem prevalent in manufacturing. Its complexity necessitates hybrid approaches since standalone methods struggle to deliver efficient solutions. The authors propose a hybrid model combining Genetic Algorithms (GA) and Tabu Search (TS). GA provides a diversified global search through the evolution of a population of solution candidates, while TS localizes the search by refining these candidates to avoid local optima. The proposed system notably incorporates innovative features like a powerful chromosome representation method, effective genetic operators, a restricted neighborhood strategy, and innovative initial solutions, which collectively enhance performance. The authors validated their approach on various benchmark JSSP datasets, successfully achieving optimal solutions in a significant number of cases, thus demonstrating its effectiveness beyond mere theoretical application. Notably, the system performed particularly well in real-world implementations, offering superior scheduling solutions for job shops in the steel and automotive industries, showcasing its adaptability and robustness in practical scenarios. The computational efficacy was highlighted, reporting significant reductions in make-span when compared to existing manual scheduling techniques. This indicates the applicability of the hybrid model for broad industrial use and its potential to impact operational efficiency positively. Future work may focus on further optimization of parameters and exploration of additional hybrid techniques to enhance solution quality across diverse scheduling scenarios.",
      "categories": [
        "Genetic algorithms",
        "Tabu search",
        "Job shop",
        "Scheduling",
        "Hybrid systems"
      ],
      "processed_at": "2025-08-20 02:06:09"
    },
    {
      "filename": "jors_2011_4 -- 1b4d5be106b911af88229799f46fc885 -- Anna’s Archive.pdf",
      "title": "A hybrid shifting bottleneck procedure algorithm for the parallel-machine job-shop scheduling problem",
      "abstract": "In practice, parallel-machine job-shop scheduling (PMJSS) is very useful in the development of standard modelling approaches and generic solution techniques for many real-world scheduling problems. In this paper, based on the analysis of structural properties in an extended disjunctive graph model, a hybrid shifting bottleneck procedure (HSBP) algorithm combined with Tabu Search (TS) metaheuristic algorithm is developed to deal with the PMJSS problem. The original-version shifting bottleneck procedure (SBP) algorithm for job-shop scheduling (JSS) has been significantly improved to solve the PMJSS problem with four novelties: (i) a topological-sequence algorithm is proposed to decompose the PMJSS problem in a set of single-machine scheduling (SMS) and/or parallel-machine scheduling subproblems; (ii) a modified Carlier algorithm based on the proposed lemmas and the proofs is developed to solve the SMS subproblem; (iii) the Jackson rule is extended to solve the PMS subproblem; (iv) a TS metaheuristic algorithm is embedded under the framework of SBP to optimise the JSS and PMJSS cases. The computational experiments show that the proposed HSBP is very efficient in solving the JSS and PMJSS problems.",
      "method": "A hybrid shifting bottleneck procedure (HSBP) algorithm integrated with Tabu Search (TS) for solving PMJSS, featuring a topological-sequence algorithm to decompose problems into SMS and PMS subproblems, along with a modified Carlier algorithm and an extended Jackson rule.",
      "objectives": "To improve the efficiency and effectiveness of scheduling in parallel-machine job-shop settings using a hybrid algorithm that combines a modified SBP with metaheuristics, specifically addressing the computational complexity associated with PMJSS.",
      "summary": "The paper addresses the parallel-machine job-shop scheduling (PMJSS) problem, a significant challenge in production and operations management. The authors develop a hybrid shifting bottleneck procedure (HSBP) algorithm leveraging structural properties analyzed through an extended disjunctive graph (DG) model. The combined HSBP algorithm incorporates several innovations: notably, a topological-sequence algorithm for problem decomposition into manageable single-machine scheduling (SMS) and parallel-machine scheduling (PMS) subproblems, alongside a modified Carlier algorithm, enhanced Jackson rules, and the Tabu Search (TS) metaheuristic framework for optimization. The proposed methodology significantly improves upon the traditional shifting bottleneck procedure (SBP), addressing its limitations when applied to PMJSS. The computational experiments demonstrate the algorithm's superior efficiency and applicability across both JSS and PMJSS scenarios, validating the enhanced approach through extensive benchmarking on instances from established datasets. The results indicate an ability to reduce makespan and improve overall scheduling performance in complex environments. Future implications suggest that this model can be adapted to various real-world scenarios beyond manufacturing, including logistics and service-oriented operations. Overall, the authors contribute to both theoretical algorithms and practical applications in scheduling, demonstrating significant advancements in addressing the multifaceted challenges of PMJSS.",
      "categories": [
        "scheduling",
        "heuristics",
        "parallel-machine",
        "job-shop",
        "shifting bottleneck procedure",
        "metaheuristics"
      ],
      "processed_at": "2025-08-20 02:06:09"
    },
    {
      "filename": "s10845-013-0837-8 -- 63850fd2de6bc657b8d6c5657887fb68 -- Anna’s Archive.pdf",
      "title": "A research survey: review of AI solution strategies of job shop scheduling problem",
      "abstract": "This paper focus on artiﬁcial intelligence appr- oaches to NP-hard job shop scheduling (JSS) problem. In the literature successful approaches of artiﬁcial intelligence techniques such as neural network, genetic algorithm, multi agent systems, simulating annealing, bee colony optimiza- tion, ant colony optimization, particle swarm algorithm, etc. are presented as solution approaches to job shop scheduling problem. These studies are surveyed and their successes are listed in this article.",
      "method": "The paper surveys various artificial intelligence approaches for the Job Shop Scheduling (JSS) problem, detailing techniques such as genetic algorithms, neural networks, ant colony optimization, and others to evaluate their effectiveness in solving JSS.",
      "objectives": "To present a comprehensive survey of artificial intelligence techniques applied to the NP-hard job shop scheduling problem (JSS), summarizing their methodologies and outcomes from 1997 to 2012.",
      "summary": "Job shop scheduling (JSS) presents a complex and challenging problem, categorized as NP-hard due to its combinatorial nature. The difficulty lies in efficiently allocating limited resources over time to perform a predetermined collection of tasks while optimizing performance criteria. This paper conducts a thorough review of artificial intelligence (AI) solution strategies applied to JSS over a 15-year period from 1997 to 2012. Key AI techniques including genetic algorithms (GAs), neural networks (NNs), ant colony optimization (ACO), particle swarm optimization (PSO), and others are evaluated based on their successes in providing effective solutions to JSS.\n\nThe survey underscores the rise of GAs, agent-based systems, and ACO while documenting a decline in the use of NNs. The methodology includes a classification of articles based around usage of specific algorithms and objective functions. It further elaborates on the unique solution characteristics and performance metrics of each AI strategy across various studies. The results indicate that while no single algorithm emerged as the unequivocal best across all scenarios, many demonstrated specific strengths in minimizing makespan, tardiness, or other critical scheduling metrics under varying operational constraints. Especially notable was the hybridization of these algorithms, which often yielded superior outcomes compared to traditional heuristic approaches.\n\nThe practical applications of JSS solutions, particularly in manufacturing processes, emphasize the necessity for efficient scheduling techniques to enhance competitiveness in the production environment. Future research directions are suggested, focusing on the exploration of hybrid models and enhancements in computational efficiency, as current algorithms, while effective, do not guarantee optimal solutions. The findings advocate for continued innovation in AI methodologies to further advance JSS solutions.",
      "categories": [
        "Artificial intelligence",
        "Scheduling",
        "Metaheuristic"
      ],
      "processed_at": "2025-08-20 02:08:06"
    },
    {
      "filename": "A Variable Group Parallel Flexible Job Shop Scheduling in a -- Yeonjee Choi; Hyun Suk Hwang; Chang Soo Kim -- IEEE Access, 11, 2023 -- Institute of -- 10_1109_access_2023_3295824 -- 9708115b74028d7f37a3b59a6afd7d90.pdf",
      "title": "A Variable Group Parallel Flexible Job Shop Scheduling in a SMEs Manufacturing Platform",
      "abstract": "Manufacturing is a broad field with different types of production processes. Therefore, specific processes can accommodate multiple parallel machines operating simultaneously in some production environments. This assumption is particularly crucial in factory scheduling for industries such as textile, aircraft, and semiconductor manufacturing. The assumption proposed in this paper is differ from FJSP in that they are closer to the real world by allowing different machines to perform the same multiple processes. In this paper, a new approach for solving the flexible job shop scheduling problem has been proposed, which is referred to as the flexible job shop scheduling problem in a parallel machine environment with a variable group. We proposed a hybrid genetic algorithm-based variable neighborhood search algorithm (GA-VNS) to solve this problem, where the multiple parallel machines can operate the same operations simultaneously and are grouped as a variable group. The GA-VNS algorithm combines the global searching ability of GA with the local searching ability of VNS to fully reflect the condition of the parallel machines with variable groups. The objective functions of the algorithm are to minimize the production makespan and to improve facility usage. Multiple simulation experiments are conducted using forty-seven test instances to assess the feasibility and effectiveness of the new approach. This study is expected to reduce processing time and production costs for Small and Medium Enterprises (SMEs) with low cost and high efficiency compared to existing systems, such as the manufacturing execution system, enterprise resource planning, and job shop scheduling system.",
      "method": "A hybrid genetic algorithm-based variable neighborhood search algorithm (GA-VNS)",
      "objectives": "To propose a new approach for solving the flexible job shop scheduling problem in a parallel machine environment with a variable group, minimizing production makespan and improving facility usage.",
      "summary": "This paper addresses the flexible job shop scheduling problem (FJSP), which is known to be NP-hard, and proposes a novel solution utilizing the concept of variable groups in parallel machine environments. The motivation behind this research stems from the need to adapt manufacturing systems, particularly in small and medium-sized enterprises (SMEs), to modern demands for efficiency and cost-effectiveness. Traditional approaches often restrict machines to perform single jobs, which does not reflect the complexities of modern production lines where multiple machines can operate on the same jobs simultaneously. The authors present a hybrid genetic algorithm combined with variable neighborhood search (GA-VNS), which enhances both global and local search capabilities. The methodology involves encoding operations and machines, performing selection, crossover, and mutation, followed by local optimization using several heuristics to fine-tune the results. Key contributions include the development of a modified FJSP suited for parallel machine settings and thorough validation through extensive simulation experiments involving forty-seven test instances. The GA-VNS method showed superior results, effectively minimizing makespan and improving overall facility usage compared to existing scheduling systems. Testing revealed that the proposed algorithm increases production efficiency significantly for SMEs, providing solutions that decrease processing time and costs while increasing adaptability to varied production requirements. The findings have substantial implications for the scheduling practices of SMEs, suggesting that a transition toward flexible, real-time scheduling systems could yield significant operational benefits. Future work will focus on enhancing the algorithm's capabilities to address more complex scheduling scenarios and integrating it with broader manufacturing and supply chain systems.",
      "categories": [
        "Genetic algorithms",
        "variable neighborhood search algorithm",
        "flexible job shop scheduling problem",
        "global and local searching algorithm",
        "parallel machines",
        "small and medium sized enterprises",
        "manufacturing platform"
      ],
      "processed_at": "2025-08-20 02:08:07"
    },
    {
      "filename": "A Novel Metaheuristic Hybrid Parthenogenetic Algorithm for -- Atefeh Momenikorbekandi; Maysam F_ Abbod -- IEEE Access, 11, 2023 -- Institute of -- 10_1109_access_2023_3278372 -- acf99a4788acdf7bb223ef60e312e520.pdf",
      "title": "A Novel Metaheuristic Hybrid Parthenogenetic Algorithm for Job Shop Scheduling Problems: Applying an Optimization Model",
      "abstract": "Metaheuristics are primarily developed to explore optimization techniques in many practice areas. Metaheuristics refer to computational procedures leading to finding optimal solutions to optimization problems. Due to the increasing number of optimization problems with large-scale data, there is an ongoing demand for metaheuristic algorithms and the development of new algorithms with more efficiencies and improved convergence speed implemented by a mathematical model. One of the most popular optimization problems is job shop scheduling problems. This paper develops a novel metaheuristic hybrid Parthenogenetic Algorithm (NMHPGA) to optimize flexible job shop scheduling problems for single-machine and multi-machine job shops and a furnace model. This method is based on the principles of genetic algorithm (GA), underlying the combinations of different types of selections, proposed ethnic GA, and hybrid parthenogenetic algorithm. In this paper, a parthenogenetic algorithm (PGA) combined with ethnic selection GA is tested; the parthenogenetic algorithm version includes parthenogenetic operators: swap, reverse, and insert. The ethnic selection uses different selection operators such as stochastic, roulette, sexual, and aging; then, top individuals are selected from each procedure and combined to generate an ethnic population. The ethnic selection procedure is tested with the PGA types on a furnace model, single-machine job shops, and multi-machines with tardiness, earliness, and due date penalties. A comparison of obtained results of the established algorithm with other selection procedures indicated that the NMHPGA is achieving better objective functions with faster convergence speed.",
      "method": "The proposed method is a Novel Metaheuristic Hybrid Parthenogenetic Algorithm (NMHPGA) that integrates ethnic selection with parthenogenetic operators (swap, reverse, and insert) to enhance optimization in flexible job shop scheduling problems. This method processes both single-machine and multi-machine scenarios, leveraging different selection procedures including stochastic, roulette, sexual, and aging in an ethnic selection framework. The NMHPGA focuses on improving convergence speed and solution quality through this hybrid approach and is validated with extensive computational experiments on established benchmarks and a furnace model.",
      "objectives": "The primary objective of this research is to develop and test a novel hybrid optimization algorithm (NMHPGA) for job shop scheduling problems that enhances solution quality and convergence speed compared to existing methods. Specifically, it targets the efficient scheduling of single and multi-machine setups with considerations for tardiness, earliness, and due date penalties, showcasing improved performance metrics compared to traditional methods.",
      "summary": "This paper presents a novel approach for solving job shop scheduling problems (JSSP) through the development of a hybrid algorithm named Novel Metaheuristic Hybrid Parthenogenetic Algorithm (NMHPGA). This algorithm aims to tackle the complexity of JSSP, which is classified as NP-hard due to its exponential growth in computation time as the problem size increases. The NMHPGA integrates ethnic selection with parthenogenetic algorithms, utilizing operators like swap, reverse, and insert to enhance genetic representation without traditional crossover processes. This innovative combination enables the algorithm to maintain genetic diversity while improving convergence speed. The performance of NMHPGA is evaluated against standard benchmarks, demonstrating significant improvements in both the quality of solutions and the speed of reaching them. The experiments reveal that NMHPGA not only yields better objective function values but also provides a more reliable convergence rate compared to other hybrid genetic algorithms and standard parthenogenetic approaches. Practical applications include optimizing scheduling in manufacturing environments, specifically for single and multi-machine setups, addressing issues like tardiness and due date penalties. Overall, this work emphasizes the need for efficient algorithmic strategies in handling complex scheduling tasks in modern industrial operations and suggests potential for further enhancements by exploring additional hybridization and selection strategies in future studies.",
      "categories": [
        "metaheuristic",
        "hybrid parthenogenetic algorithm",
        "job shop scheduling",
        "optimization",
        "genetic algorithm"
      ],
      "processed_at": "2025-08-20 02:10:07"
    }
  ]
}