{
  "category_name": "Industry Applications & Emerging Technologies",
  "description": "Industrial applications, performance evaluation, and emerging technological approaches",
  "paper_count": 3,
  "papers": [
    {
      "filename": "Job shop scheduling model for a sustainable manufacturing - Anna’s Archive.pdf",
      "title": "Job shop scheduling model for a sustainable manufacturing",
      "abstract": "Technological development was not always environmental-friendly but it led to problems that affect the entire population, such as climate change and the depletion of non-renewable resources. In recent years, we are trying to change the concept of industrialization, with a more prudent and focused view to environmental issues. In this perspective, the setting of the fourth industrial revolution, called Industry 4.0, seeks to make technological development sustainable with the crucial aim of resource saving firstly. This study aims at introducing a smart tool, based on the application of a mathematical model, already proposed in literature, for the job scheduling from an energy saving perspective into a real company IT system. After a preliminary introduction on the concepts of sustainability and industry 4.0, and how they are connected to each other, and a second part that will deal with Smart Factory, smart factories oriented to customization and flexibility, the mathematical model of activity scheduling will be discussed and applied to a specific IT system. This model, in fact, properly implemented into a Manufacturing Execution System (MES) will represent a powerful tool oriented to the efficient use of energy resources.",
      "method": "The study proposes a mathematical model focused on energy-efficient job scheduling in manufacturing processes. The approach involves integrating this model into a Manufacturing Execution System (MES) that optimizes scheduling based on energy consumption and operational efficiency. The model addresses the Flexible Job Shop Scheduling Problem (FJSP) by implementing a mixed linear programming strategy, particularly focusing on the on/off strategies for machinery to minimize idle energy use while considering various operational parameters.",
      "objectives": "To present a job scheduling model that balances production efficiency with energy consumption in a manufacturing context, particularly under the auspices of Industry 4.0 and sustainability.",
      "summary": "This paper addresses the pressing issue of energy consumption in manufacturing, especially within the context of Industry 4.0. The primary problem tackled is how to integrate sustainability into manufacturing processes, given the growing concerns about climate change and resource depletion. The authors introduce a smart mathematical model designed to improve job shop scheduling from an energy-saving perspective, demonstrating the feasibility of incorporating this model into a current Manufacturing Execution System (MES) in a real-world industrial setting. \n\nThe study begins by discussing the theoretical foundation of sustainability and the principles of Industry 4.0, arguing for their interconnectedness. The mathematical model proposed is implemented in a medium-sized enterprise involved in aircraft component production, where it aims to reduce energy expenditure during manufacturing operations. The model utilizes an on/off strategy to manage machine idle times, thus minimizing energy consumption, which is particularly impactful considering that a significant portion of the energy operational costs arise during idle periods.\n\nKey findings indicate that applying the proposed job scheduling approach can enhance energy efficiency significantly. In the case study presented, a reduction in operational costs was noted, achieving a savings of 1.2% compared to conventional scheduling methods. Importantly, the results suggest that such scheduling not only benefits economic efficiency but also contributes positively to environmental sustainability by reducing energy wastage and associated CO2 emissions.\n\nIn conclusion, the paper suggests that future research could focus on refining the scheduling model to include additional parameters, such as machine setup times and energy generated from renewable sources, thereby enhancing the model's applicability in increasingly eco-conscious industrial environments. This work demonstrates a practical intersection between advanced manufacturing technologies and sustainability, illustrating how the implementation of smart scheduling models can lead industries toward a more sustainable future while maintaining competitive edges in productivity and cost-efficiency.",
      "categories": [
        "Sustainable manufacturing",
        "job scheduling",
        "energy saving"
      ],
      "processed_at": "2025-08-20 01:56:07"
    },
    {
      "filename": "Flexible job shop scheduling problem under Industry 5_0_ A -- Candice Destouet; Houda Tlahig; Belgacem Bettayeb; Bélahcène -- Journal of Manufacturing -- 10_1016_j_jmsy_2023_01_004 -- 17256aa7754955a375545d4426acccab.pdf",
      "title": "Flexible job shop scheduling problem under Industry 5.0: A survey on human reintegration, environmental consideration and resilience improvement",
      "abstract": "The Job Shop Scheduling Problem (JSSP) has been widely studied in recent decades. Various approaches have been proposed to support scheduling decisions according to the evolving production environment. The emergence of technological advancements in the context of Industry 4.0 has brought many changes and made production scheduling more and more efficient. Today’s Industry 5.0 environment pays much attention to human considerations, sustainability, and resilience. These modern production environments can be accurately represented by the flexible shop floor scheduling problem in which various coordinating machines (with many alternative routing possibilities) and different operators are challenging. Recent literature on JSSP, which considers the human in the loop, has shown that the well-being and skills of workers significantly affect scheduling performance. In addition, knowing that industries are responsible for a significant part of the world’s energy consumption and greenhouse gas (GHG) emissions, new studies in scheduling focus on environmental factors. This paper introduces the Sustainable Flexible Scheduling Problem (SFJSSP) as a human and energy-efficiency-centered scheduling problem. First, we review the last decade’s literature on Flexible Job Shop Scheduling Problems (FJSSP) with human and/or environmental considerations. Next, we analyze the development trends in manufacturing scheduling problems. Finally, we discuss future research challenges to move towards scheduling 5.0 and suggest a mathematical model that considers human and environmental factors (in addition to the factors considered by the Classical Flexible Job Shop Scheduling Problem (CFJSSP)).",
      "method": "This paper reviews the literature on Flexible Job Shop Scheduling Problems (FJSSP) considering human and environmental factors and presents a proposed mathematical model for the Sustainable Flexible Job Shop Scheduling Problem (SFJSSP) that prioritizes human well-being and energy efficiency.",
      "objectives": "The main objectives of this paper are to review the integration of human factors and environmental considerations in Flexible Job Shop Scheduling Problems (FJSSP), analyze trends in manufacturing scheduling, identify future research challenges related to Industry 5.0, and propose a mathematical model for scheduling that includes human and environmental factors.",
      "summary": "This paper provides a comprehensive survey of the research developments surrounding the Flexible Job Shop Scheduling Problem (FJSSP) in the context of Industry 5.0, emphasizing the integration of human factors and environmental considerations. The emergence of Industry 4.0 has already instigated significant changes in the methodologies used for scheduling problems within manufacturing systems. As we transition towards Industry 5.0, the focus shifts onto three core values: human-centricity, sustainability, and resilience. The research highlights that human operators significantly influence scheduling performance through factors such as skills and well-being, while production scheduling must now also account for the facilities’ environmental impact, particularly energy consumption and greenhouse gas emissions. The proposed Sustainable Flexible Scheduling Problem (SFJSSP) encapsulates these issues, representing a shift towards more socially responsible and environmentally friendly scheduling practices. Through an analysis of the last decade's literature, the paper identifies existing gaps in research, particularly the lack of a dynamic perspective incorporating both human and environmental factors simultaneously. Notably, the findings suggest the need for future studies to marry these elements into scheduling models, utilizing advanced computational techniques such as hybrid algorithms that combine heuristic and AI approaches for more effective scheduling outcomes. The significance of future research is underscored by the need to address the complexities posed by dynamic scheduling environments and the specific challenges arising from the reintegration of human-centered design principles in manufacturing systems.",
      "categories": [
        "Industry 5.0",
        "Flexible job-shops scheduling problem",
        "Literature review",
        "Dynamic scheduling",
        "Human centric manufacturing",
        "Environmental consideration",
        "Sustainability",
        "Resilience"
      ],
      "processed_at": "2025-08-20 01:58:54"
    },
    {
      "filename": "Digital Twin Enhanced Dynamic Job-Shop Scheduling - Anna’s Archive.pdf",
      "title": "Digital Twin Enhanced Dynamic Job-Shop Scheduling",
      "abstract": "In this paper, we propose a digital twin (DT) enhanced dynamic job-shop scheduling methodology that addresses common bottlenecks such as machine availability prediction, disturbance detection, and performance evaluation. By integrating real and simulated data, the DT allows for improved predictions, timely rescheduling, and comprehensive performance evaluations. The effectiveness of the proposed method is illustrated through a case study involving hydraulic valve manufacturing in a job shop.",
      "method": "The proposed method integrates a five-dimension digital twin that combines real-time data from physical machines with simulated data from virtual counterparts, enabling machine availability prediction, disturbance detection, and performance evaluation. The methodology consists of three key approaches: (1) machine availability prediction using data from both physical and virtual machines; (2) disturbance detection comparing the physical and virtual entities; and (3) multi-dimensional performance evaluation using various simulation models.",
      "objectives": "The main objective of this research is to enhance dynamic job-shop scheduling by leveraging digital twin technology to improve machine availability prediction, effectively detect disturbances, and provide comprehensive performance evaluations, all of which contribute to more optimal scheduling decisions.",
      "summary": "Dynamic job-shop scheduling is essential for optimizing production processes but often faces challenges due to machine unavailability and various disturbances. The paper addresses these issues by incorporating the concept of a digital twin (DT), which creates a sophisticated link between physical machines and their virtual counterparts. The essential contributions of this research include a detailed exploration of DT-based methods for machine availability prediction, disturbance detection, and performance evaluation. The study defines a five-dimension digital twin model for machines, fusing real-time operational data with simulated information to inform scheduling decisions effectively. The predictive capabilities of the DT enable early detection of machine faults and tool wear, predicting the remaining useful life (RUL) of tools while ensuring machines are available when required. Moreover, disturbances are detected by comparing parameters of the physical machine with those of its digital counterpart, allowing for timely adjustments to live scheduling conditions.\n\nA case study involving a machining job-shop producing hydraulic valves demonstrates the practicality and effectiveness of the proposed methodologies. The results show substantial improvements in scheduling performance metrics, such as reduced makespan, minimized tardiness, and enhanced machine utilization. Furthermore, the DT model's multi-dimensional capabilities provide comprehensive insights into operational efficiency, including energy consumption and stress levels of machinery, thereby elevating the overall production system's responsiveness and reliability. The paper concludes that the DT-enhanced dynamic scheduling methodology not only addresses the current limitations in job-shop scheduling but also sets the groundwork for further expansions in smart manufacturing practices, emphasizing an integrated approach that could yield significant flexibility and efficiency in future industrial operations.",
      "categories": [
        "Digital Twin",
        "Dynamic scheduling",
        "Machine availability",
        "Disturbance detection",
        "Performance evaluation"
      ],
      "processed_at": "2025-08-20 02:06:09"
    }
  ]
}